# Домашняя Работа !!
# Работаем только с файлом california_housing_test.csv 
1)Прочесть с помощью pandas файл california_housing_test.csv 

2)Посмотреть сколько в нем строк и столбцов

3)Определить какой тип данных имеют столбцы

4)Показать longitude где housing_median_age < 35

5)Показать столбцы longitude и latitude

6)Выбрать данные где total_rooms < 2000 и population > 1500
  
7)Определить какое максимальное и минимальное значение **population**

8)(Доп) Показать максимальное **longitude**, где **median_income** > 3

9)(Доп) Узнать какая максимальная **total_bedrooms** при минимальном значении **households**

In [2]:
# Библиотека для работы с табличными данными
import pandas as pd

1)Прочесть с помощью pandas файл california_housing_test.csv

In [3]:
# Прочтём файл .csv с помощью библиотеки pandas
df = pd.read_csv('california_housing_test.csv')

2)Посмотреть сколько в нем строк и столбцов

In [4]:
# Возвращает размеры таблицы: кортеж из 2 значений, 1 кол-во строк, 2 - кол-во столбцов
df.shape

(3402, 9)

3)Определить какой тип данных имеют столбцы

In [5]:
# Проверить тип данных в столбцах
# В данных случаях везде float, число 64 указывает на разрядность(Используется 64 байта для хранения значения в памяти,
# чем меньше разрядность, тем меньший диапазон могут принимать числа и тем меньше тратится памяти на хранение.
df.dtypes

Unnamed: 0              int64
longitude             float64
latitude              float64
housing_median_age      int64
total_rooms             int64
total_bedrooms          int64
population              int64
households              int64
median_income         float64
dtype: object

4)Показать longitude где housing_median_age < 35

In [6]:
# Выбор определенного кол-ва рядов
# Синтаксис df[df[col] !=|==|>|<| значение]
df.loc[df['housing_median_age'] < 35, ['longitude']]

      longitude
0       -117.66
1       -117.07
2       -117.91
3       -117.19
4       -119.58
...         ...
3392    -122.10
3393    -117.52
3395    -117.01
3398    -117.88
3399    -118.32

[2216 rows x 1 columns]

5)Показать столбцы longitude и latitude

In [7]:
# Выбор нескольких столбцов [долгота, широта]
df[['longitude', 'latitude']]

      longitude  latitude
0       -117.66     35.60
1       -117.07     32.71
2       -117.91     33.61
3       -117.19     34.05
4       -119.58     36.83
...         ...       ...
3397    -118.33     34.09
3398    -117.88     34.09
3399    -118.32     34.26
3400    -118.12     33.80
3401    -118.19     33.78

[3402 rows x 2 columns]

6)Выбрать данные где total_rooms < 2000 и population > 1500

In [8]:
# Для отбора можно использовать несколько условий одновременно
# Знак & означает 'and', а знак | 'or'
df[(df['total_rooms'] < 2000) & (df['population'] > 00)]

,Unnamed: 0,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income
0,1,-117.66,35.60,14,1740,391,850,317,2.5812
2,3,-117.91,33.61,27,1797,343,435,203,5.9196
5,6,-120.94,37.40,32,1175,208,774,222,3.0000
6,7,-118.30,34.17,37,350,115,342,111,3.0687
7,8,-122.51,37.91,2,647,136,203,118,6.6410
...,...,...,...,...,...,...,...,...,...
3388,3389,-122.06,37.64,33,1160,252,729,220,3.8259
3392,3393,-122.10,37.19,18,808,136,420,145,7.1831
3397,3398,-118.33,34.09,36,654,186,416,138,3.6953
3400,3401,-118.12,33.80,35,1835,435,774,418,2.7092
3401,3402,-118.19,33.78,42,1021,300,533,187,1.8036

7)Определить какое максимальное и минимальное значение population

In [9]:
# Максимальное значение
print(df['population'].max())
# Минимальное значение
print(df['population'].min())

35682
8

8)(Доп) Показать максимальное longitude, где median_income > 3

---

Для отбора можно использовать несколько условий одновременно

Знак & означает 'and', а знак | 'or'

---

Выбор определенного кол-ва рядов

Синтаксис df[df[col] !=|==|>|<| значение]

---

In [10]:
df.loc[(df['median_income'] > 3), ['longitude']].max()

longitude   -115.37
dtype: float64

9)(Доп) Узнать какая максимальная total_bedrooms при минимальном значении households

In [11]:
df.loc[(df['households'].min()), ['total_bedrooms']].max()

863.0